<?php
/*
  1.變數的引用
  PHP 的引用允許你用兩個變數來指向同一個內容
*/

echo "1.變數的引用"."<br>";
echo "PHP 的引用允許你用兩個變數來指向同一個內容"."<br>";

$a="ABC";
$b =&$a;
echo $a."<br>";//這裡輸出:ABC
echo $b."<br>";//這裡輸出:ABC

$b="EFG";
echo $a."<br>";//這裡$a的值變為EFG 所以輸出EFG
echo $b."<br>";//這裡輸出EFG

$a="123";
echo $a."<br>";//這裡$a的值變為123 所以輸出123
echo $b."<br>";//這裡輸出123

/*
  2.函數的引用傳遞（傳址調用）
*/
echo "2.函數的引用傳遞（傳址調用）"."<br>";
function test(&$a)
{
    $a=$a+100;
}
$b=1;
echo $b."<br>";//輸出１

test($b);   //這裡$b傳遞給函數的其實是$b的變數內容所處的內存地址，通過在函數裡改變$a的值　就可以改變$b的值了
echo "<br>";
echo $b;//輸出101